Tekla Open API Reference for Tekla Structures 2025
Integer.Value Property
 The value of the integer datatype.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Value { get; set; }
Public Property Value As Integer
	Get
	Set
Property Value
Type: Int32
Implements
IIntDataType.Value
See Also
Reference
Integer Structure
Tekla.Structures.Datatype Namespace